/**
 *****************************************
 * Created by edonet@163.com
 * Created on 2019-07-23 20:09:58
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
const { types } = require('@babel/core');


/**
 *****************************************
 * 创建资源节点
 *****************************************
 */
module.exports = (value, { start, end, loc }) => {
    return Object.assign(types.stringLiteral(value), { start, end, loc });
};
